; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v3)
		(pred_1 ?v8)
		(pred_4 ?v1)
		(pred_2 ?v1)
		(pred_5 ?v8 ?v1)
		(pred_3)
		(pred_6 ?v8))

   (:action op_2
       :parameters  (?v2 ?v4)
       :precondition (and (not-eq ?v2 ?v4) 
                          (pred_4 ?v2) (pred_4 ?v4) (pred_2 ?v2))
       :effect (and  (pred_2 ?v4)
		     (not (pred_2 ?v2))))


   (:action op_1
       :parameters (?v6 ?v5)
       :precondition  (and  (pred_1 ?v6) (pred_4 ?v5)
			    (pred_5 ?v6 ?v5) (pred_2 ?v5) (pred_3))
       :effect (and (pred_6 ?v6)
		    (not (pred_5 ?v6 ?v5)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v6  ?v5)
       :precondition  (and  (pred_1 ?v6) (pred_4 ?v5)
			    (pred_6 ?v6) (pred_2 ?v5))
       :effect (and (pred_5 ?v6 ?v5)
		    (pred_3)
		    (not (pred_6 ?v6)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_03 obj_07 obj_05 obj_06 
          obj_04 obj_02 obj_01 
)
(:init
(pred_4 obj_03)
(pred_4 obj_07)
(pred_4 obj_05)
(pred_4 obj_06)
(pred_1 obj_04)
(pred_1 obj_02)
(pred_1 obj_01)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(pred_3)
(pred_5 obj_04 obj_07)
(pred_5 obj_02 obj_05)
(pred_5 obj_01 obj_06)
(pred_2 obj_03)
)
(:goal
(and
(pred_5 obj_04 obj_03)
(pred_5 obj_02 obj_06)
(pred_5 obj_01 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_04 obj_03) (pred_2 obj_05))
    (sometime-before  (pred_5 obj_02 obj_06) (pred_2 obj_07))
    (sometime-before  (pred_5 obj_01 obj_07) (pred_2 obj_05))
  )
)
)

; plan
1. (op_2 obj_03 obj_06)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_06)
   goals met: 0 of 3
2. (op_1 obj_01 obj_06)
   deleted: (pred_5 obj_01 obj_06) (pred_3)
   added: (pred_6 obj_01)
   goals met: 0 of 3
3. (op_2 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_07)
   goals met: 0 of 3
4. (op_2 obj_07 obj_03)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_03)
   goals met: 0 of 3
5. (op_3 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_5 obj_01 obj_03) (pred_3)
   goals met: 0 of 3
6. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_05)
   goals met: 0 of 3
7. (op_1 obj_02 obj_05)
   deleted: (pred_5 obj_02 obj_05) (pred_3)
   added: (pred_6 obj_02)
   goals met: 0 of 3
8. (op_2 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 0 of 3
9. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_5 obj_02 obj_06) (pred_3)
   goals met: 1 of 3
10. (op_2 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_07)
   goals met: 1 of 3
11. (op_1 obj_04 obj_07)
   deleted: (pred_5 obj_04 obj_07) (pred_3)
   added: (pred_6 obj_04)
   goals met: 1 of 3
12. (op_2 obj_07 obj_03)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_03)
   goals met: 1 of 3
13. (op_3 obj_04 obj_03)
   deleted: (pred_6 obj_04)
   added: (pred_5 obj_04 obj_03) (pred_3)
   goals met: 2 of 3
14. (op_1 obj_01 obj_03)
   deleted: (pred_5 obj_01 obj_03) (pred_3)
   added: (pred_6 obj_01)
   goals met: 2 of 3
15. (op_2 obj_03 obj_07)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_07)
   goals met: 2 of 3
16. (op_3 obj_01 obj_07)
   deleted: (pred_6 obj_01)
   added: (pred_5 obj_01 obj_07) (pred_3)
   goals met: 3 of 3
